Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the emptiness of internal phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཕྱི་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The nature of the emptiness of external phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The nature of the emptiness of external and internal phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The nature of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ནང་སྟོང་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the emptiness of internal phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཕྱི་སྟོང་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་ནི། གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the emptiness of external phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་ནི། གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the emptiness of external and internal phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་ནི། གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ནང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ནི། གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The essential nature of the emptiness of internal phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཕྱི་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ནི། གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The essential nature of the emptiness of external phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The essential nature of the emptiness of external and internal phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ངོ་བོ་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The essential nature of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ནང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The defining characteristics of the emptiness of internal phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །ཕྱི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The defining characteristics of the emptiness of external phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The defining characteristics of the emptiness of external and internal phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད་གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The defining characteristics of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The applications of mindfulness do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་གང་ནས་ཀྱང་འོང་བ་མེད།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: གང་དུ་ཡང་འགྲོ་བ་མེད་གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the applications of mindfulness does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The nature of the noble eightfold path [and the other causal attributes] does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the applications of mindfulness does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་དེ་བཞིན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the noble eightfold path [and the other causal attributes] does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The essential nature of the applications of mindfulness does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་ངོ་བོ་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The essential nature of noble eightfold path [and the other causal attributes] does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The defining characteristics of the applications of mindfulness do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་།
en: The defining characteristics of the noble eightfold path [and the other causal attributes] do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་རྣམས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of emptiness, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, and the meditative stabilities do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་རང་བཞིན་དང་། ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དང་། ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དང་། ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the meditative stabilities [and so forth], the real nature of the meditative stabilities [and so forth], the essential nature of the meditative stabilities [and so forth], and the defining characteristics of the meditative stabilities [and so forth] do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The dhāraṇī gateways, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་རང་བཞིན་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད།
en: If you ask why, Subhūti, the nature of the distinct qualities of the buddhas [and so forth], the real nature of the distinct qualities of the buddhas [and so forth], the essential nature of the distinct qualities of the buddhas [and so forth], and the defining characteristics of the distinct qualities of the buddhas [and so forth] do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ། །རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, the realm of phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the realm of phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱི་དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the realm of phenomena, the essential nature of the realm of phenomena, and the defining characteristics of the realm of phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །རབ་འབྱོར་དེ་བཞིན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, the real nature does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་ཉིད་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the real nature does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དེ་བཞིན་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དང་། དེ་བཞིན་ཉིད་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the real nature, the essential nature of the real nature, and the defining characteristics of the real nature do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །རབ་འབྱོར་ཡང་དག་པའི་མཐའ་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, the very limit of reality does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཡང་དག་པའི་མཐའི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the very limit of reality does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །ཡང་དག་པའི་མཐའི་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའི་ངོ་བོ་ཉིད་དང་། ཡང་དག་པའི་མཐའི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the very limit of reality, the essential nature of the very limit of reality, and the defining characteristics of the very limit of reality do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །རབ་འབྱོར་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, the inconceivable realm does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the inconceivable realm does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱི་དེ་བཞིན་ཉིད་དང་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the inconceivable realm, the essential nature of the inconceivable realm, and the defining characteristics of the inconceivable realm do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །རབ་འབྱོར་བྱང་ཆུབ་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, enlightenment does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of enlightenment does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of enlightenment, the essential nature of enlightenment, and the defining characteristics of enlightenment do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །རབ་འབྱོར་སངས་རྒྱས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, the buddhas do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of the buddhas does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །སངས་རྒྱས་ཀྱི་དེ་བཞིན་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ངོ་བོ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of the buddhas, the essential nature of the buddhas, and the defining characteristics of the buddhas do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །རབ་འབྱོར་འདུས་བྱས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, conditioned phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདུས་བྱས་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of conditioned phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །འདུས་བྱས་ཀྱི་དེ་བཞིན་ཉིད་དང་། འདུས་བྱས་ཀྱི་ངོ་བོ་ཉིད་དང་། འདུས་བྱས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of conditioned phenomena, the essential nature of conditioned phenomena, and the defining characteristics of conditioned phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere. “

source: །རབ་འབྱོར་འདུས་མ་བྱས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: Subhūti, unconditioned phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདུས་མ་བྱས་ཀྱི་རང་བཞིན་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: If you ask why, Subhūti, the nature of unconditioned phenomena does not come from anywhere, does not go anywhere, and does not dwell anywhere.

source: །འདུས་མ་བྱས་ཀྱི་དེ་བཞིན་ཉིད་དང་། འདུས་མ་བྱས་ཀྱི་ངོ་བོ་ཉིད་དང་། འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད། གང་དུ་ཡང་འགྲོ་བ་མེད། གར་ཡང་གནས་པར་འགྱུར་བ་མེད་དོ།
en: The real nature of unconditioned phenomena, the essential nature of unconditioned phenomena, and the defining characteristics of unconditioned phenomena do not come from anywhere, do not go anywhere, and do not dwell anywhere. {

source: །རབ་འབྱོར་དེ་ལྟར་ཐེག་པ་ཆེན་པོ་དེ་ནི། འོང་བ་མེད། འགྲོ་བ་ཡང་མེད། གནས་པ་ཡང་མེད་དོ།
en: Dt.240} So it is, Subhūti, that this Great Vehicle neither comes, nor goes, nor dwells. “

source: །རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཐེག་པ་དེ་ལ་སྔོན་གྱི་མཐའ་ཡང་མི་དམིགས་སོ། །ཕྱི་མའི་མཐའ་ཡང་མི་དམིགས། དབུས་ཀྱང་མི་དམིགས་ཏེ། འདི་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཐེག་པ་སྟེ། ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ།
en: Subhūti, you have also said that this vehicle neither apprehends the limit of the past, nor does it apprehend the limit of the future, or the intervening present, and that this vehicle is styled the Great Vehicle and designated as ‘the sameness of the three times.’

source: །ཞེས་སྨྲས་པ་ནི་དེ་དེ་བཞིན་ནོ།
en: That is so, Subhūti!

source: ཐེག་པ་འདི་ལ་སྔོན་གྱི་མཐའ་ཡང་མི་དམིགས། ཕྱི་མའི་མཐའ་ཡང་མི་དམིགས། དབུས་ཀྱང་མི་དམིགས་ཏེ།
en: This vehicle neither apprehends the limit of the past, nor does it apprehend the limit of the future, or the intervening present.

source: དུས་གསུམ་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཐེག་པ་སྟེ། དེའི་ཕྱིར་ན་ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ།
en: Indeed, this vehicle is styled the Great Vehicle and designated as ‘the sameness of the three times.’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་འདས་པའི་དུས་ཀྱང་འདས་པའི་དུས་ཀྱིས་སྟོང་ངོ་། །མ་འོངས་པའི་དུས་ཀྱང་མ་འོངས་པའི་དུས་ཀྱིས་སྟོང་ངོ་། །ད་ལྟར་བྱུང་བའི་དུས་ཀྱང་ད་ལྟར་བྱུང་བའི་དུས་ཀྱིས་སྟོང་ངོ་།
en: If you ask why, Subhūti, it is because the past is indeed empty of the past; the future, too, is empty of the future; and the present, too, is empty of the present.

source: །དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱང་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: The sameness of the three times, too, is empty of the sameness of the three times.

source: །ཐེག་པ་ཆེན་པོ་དེ་ཡང་བཀའ་འགྱུར་དེ་ཡང་སྟོང་ངོ་།
en: The Great Vehicle, too, is empty of the Great Vehicle.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་སེམས་དཔས་སྟོང་ངོ་།
en: The bodhisattva, too, is empty of the bodhisattva. “

source: །རབ་འབྱོར་སྟོང་པ་ཉིད་ལ་གཅིག་ཅེས་བྱ་བ་མེད་དོ། །གཉིས་སམ་གསུམ་འམ་བཞི་འམ་ལྔ་འམ་དྲུག་གམ་བདུན་ནམ་བརྒྱད་དམ་དགུ་འམ་བཅུ་ཞེས་བྱ་བ་མེད་དོ། །ཐ་དད་ཅེས་བྱ་བ་མེད་དོ།
en: Subhūti, emptiness is not one, not two, not three, not four, not five, not six, not seven, not eight, not nine, and not ten, but nor is it anything else.

source: །དེ་ལྟ་བས་ན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མཉམ་པ་ཉིད་ཀྱི་ཐེག་པ་སྟེ།
en: So this is the vehicle of sameness that bodhisattva great beings possess.

source: དེ་ལ་མཉམ་པ་དང་མི་མཉམ་པ་མི་དམིགས་སོ།
en: It does not apprehend [notions of] ‘same’ or ‘not same.’

source: །དེ་ལ་འདོད་ཆགས་དང་། འདོད་ཆགས་དང་བྲལ་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend desire or absence of desire.

source: །ཞེ་སྡང་དང་ཞེ་སྡང་མེད་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend hatred or the absence of hatred.

source: །གཏི་མུག་དང་གཏི་མུག་མེད་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend delusion or the absence of delusion.

source: །མིང་དང་མིང་མེད་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend pride or the absence of pride.

source: །འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱང་མི་དམིགས་སོ།
en: It does not apprehend conditioned phenomena or unconditioned phenomena.

source: །དགེ་བ་དང་མི་དགེ་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend virtuous actions or nonvirtuous actions.

source: །ཁ་ན་མ་ཐོ་བ་ཡོད་པ་དང་ཁ་ན་མ་ཐོ་བ་མེད་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend inadmissible transgressions or the absence of inadmissible transgressions.

source: །ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend the contaminated or the uncontaminated.

source: །ཀུན་ནས་ཉོན་མོངས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend afflicted mental states or the absence of afflicted mental states.

source: །འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend the mundane or the supramundane.

source: །སྐྱེ་བ་དང་། འགག་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend arising or ceasing.

source: །ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend affliction or purification.

source: །དེ་ལ་རྟག་པ་དང་། མི་རྟག་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend permanence or impermanence.

source: །བདེ་བ་དང་། སྡུག་བསྔལ་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend happiness or suffering.

source: །བདག་དང་། བདག་མེད་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend a self or a nonself.

source: །ཞི་བ་དང་། མ་ཞི་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend peace or the absence of peace.

source: །འདོད་པའི་ཁམས་དང་། འདོད་པའི་ཁམས་ལས་ཡང་དག་པར་འདའ་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend the realm of desire or the transcendence of the realm of desire.

source: །གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་ལས་ཡང་དག་པར་འདའ་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend the realm of form or the transcendence of the realm of form.

source: །གཟུགས་མེད་པའི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ལས་ཡང་དག་པར་འདའ་བ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend the realm of formlessness or the transcendence of the realm of formlessness.

source: །འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པ་ཡང་མི་དམིགས་སོ།
en: It does not apprehend cyclic existence or nirvāṇa.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེའི་རང་བཞིན་མི་དམིགས་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because the inherent existence of all those [phenomena] is nonapprehensible. “

source: རབ་འབྱོར་འདས་པའི་གཟུགས་ནི་འདས་པའི་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: Subhūti, past physical forms are empty of past physical forms.

source: །རབ་འབྱོར་འདས་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་འདས་པའི་རྣམ་པར་ཤེས་པ་ནི་འདས་པའི་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་།
en: Subhūti, past feelings, perceptions, formative predispositions, and consciousness are empty of past consciousness [and so forth].

source: །རབ་འབྱོར་མ་འོངས་པའི་གཟུགས་ནི་མ་འོངས་པའི་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: Subhūti, future physical forms are empty of future physical forms.

source: །རབ་འབྱོར་མ་འོངས་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་མ་འོངས་པའི་རྣམ་པར་ཤེས་པ་ནི་མ་འོངས་པའི་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་།
en: Subhūti, future feelings, perceptions, formative predispositions, and consciousness are empty of future consciousness [and so forth].

source: །རབ་འབྱོར་ད་ལྟར་བྱུང་བའི་གཟུགས་ནི་ད་ལྟར་བྱུང་བའི་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: Subhūti, present physical forms are empty of present physical forms.

source: །རབ་འབྱོར་ད་ལྟར་བྱུང་བའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་ད་ལྟར་བྱུང་བའི་རྣམ་པར་ཤེས་པ་ནི་ད་ལྟར་བྱུང་བའི་རྣམ་པར་ཤེས་པས་སྟོང་ངོ་།
en: Subhūti, present feelings, perceptions, formative predispositions, and consciousness are empty of present consciousness [and so forth].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་འདས་པའི་གཟུགས་དམིགས་སུ་མེད་དེ།
en: If you ask why, in emptiness, past physical forms are nonapprehensible.

source: སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པས་དམིགས་སུ་མེད་ན།
en: Emptiness, too, is nonapprehensible because it is empty of emptiness.
